/**************************************
 *客户端界面设计
 *2020-1 by llc
 *************************************/

#include"config.h"

//主界面
void mainInterface(){
	system("clear");
	printf("\t******************************\n");
	printf("\t*******欢迎进入聊天室*********\n");
	printf("\t**********1.注册**************\n");
	printf("\t**********2.登录**************\n");
	printf("\t**********q.退出**************\n");
	printf("\t**********请输入命令**********\n");
}

//登录界面
void loginInterface(char *userName){
        system("clear");
        printf("\t******************************\n");
        printf("\t**********您好，%s!***********\n",userName);
        printf("\t**********1.查看在线用户******\n");
        printf("\t**********2.私聊**************\n");
        printf("\t**********3.群聊**************\n");
        printf("\t**********4.查看聊天记录******\n");
        printf("\t**********q.退出**************\n");
        printf("\t**********请选择相应指令******\n");
}

